In [2]:
import pandas as pd

Loc is used to select rorws and columns by their label

iloc - index based integer location

In [9]:
x = pd.Series([1, 2, 3, 4, 5])

y = [1, 2, 3, 4, 5]

df = pd.DataFrame({
    'x': x,
    'y': y
})

In [10]:
type(y)
df

   x  y
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [18]:
rows_subset = df.iloc[0:5]
rows_subset

   x  y
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5

In [19]:
row_2 = df.loc[2]
row_2

x    3
y    3
Name: 2, dtype: int64

In [20]:
r = rows_subset.loc[0:2]
r

   x  y
0  1  1
1  2  2
2  3  3

In [21]:
ir = rows_subset.iloc[0:2]
ir

   x  y
0  1  1
1  2  2

## create a specific data frame

In [13]:
row_3 = df.loc[df['x'] == 3]
row_3

   x  y
2  3  3

In [22]:
subset = df.loc[df['x'] > 2]
subset

   x  y
2  3  3
3  4  4
4  5  5

### Using Ranges of rows and columns

In [ ]:
# select specific rows , columns 
subset1 = df.iloc[1:3, 0:1]
subset1

   x
1  2
2  3

In [42]:
dfname = pd.DataFrame({
    'Name': ['John', 'Jane', 'Jim', 'Jack', 'Jill'],
    'Age': [5, 4, 3, 2, 1],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Phoenix']
})

In [43]:
# Selecting a subset of rows and columns using labels of columns

subset2 = dfname.loc[0:2, ['Name', 'Age']]
subset2

   Name  Age
0  John    5
1  Jane    4
2   Jim    3

### Renaming

In [44]:
dfname

   Name  Age         City
0  John    5     New York
1  Jane    4  Los Angeles
2   Jim    3      Chicago
3  Jack    2      Houston
4  Jill    1      Phoenix

In [45]:
dfname.rename(columns={'Name': 'Naaw', 'Age': 'Weans', 'City': 'Seakinaiy'}, inplace=True)
dfname

   Naaw  Weans    Seakinaiy
0  John      5     New York
1  Jane      4  Los Angeles
2   Jim      3      Chicago
3  Jack      2      Houston
4  Jill      1      Phoenix